Return the profiles in the fabrication configuration.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
  Since:  2016
 Syntax
  C#
public IList<string> GetProfiles()
  Visual Basic
Public Function GetProfiles As IList(Of String)
  Visual C++
public:
IList<String^>^ GetProfiles()
 Remarks
 The global profile name is empty, and is not returned here.
 See Also
  FabricationConfigurationInfo Class
  Autodesk.Revit.DB Namespace